/**
* Copyright (c) 2026 Huawei Technologies Co., Ltd.
* This program is free software, you can redistribute it and/or modify it under the terms and conditions of
* CANN Open Software License Agreement Version 2.0 (the "License").
* Please refer to the License for details. You may not use this file except in compliance with the License.
* THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED,
* INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE.
* See LICENSE in the root of the software repository for the full text of the License.
*/

#ifndef __ASCENDC_API_REGBASE_IGAMMAC_HELPER_AYMPTOTIC_SERIES_H__
#define __ASCENDC_API_REGBASE_IGAMMAC_HELPER_AYMPTOTIC_SERIES_H__

namespace AscendC {
namespace {
constexpr float kAsymptoticD[25][25] = {
    {-3.3333333333333333e-1f,  8.3333333333333333e-2f,  -1.4814814814814815e-2f,
            1.1574074074074074e-3f,   3.527336860670194e-4f,   -1.7875514403292181e-4f,
            3.9192631785224378e-5f,   -2.1854485106799922e-6f, -1.85406221071516e-6f,
            8.296711340953086e-7f,    -1.7665952736826079e-7f, 6.7078535434014986e-9f,
            1.0261809784240308e-8f,   -4.3820360184533532e-9f, 9.1476995822367902e-10f,
            -2.551419399494625e-11f,  -5.8307721325504251e-11f, 2.4361948020667416e-11f,
            -5.0276692801141756e-12f, 1.1004392031956135e-13f, 3.3717632624009854e-13f,
            -1.3923887224181621e-13f, 2.8534893807047443e-14f, -5.1391118342425726e-16f,
            -1.9752288294349443e-15f},
    {-1.8518518518518519e-3f,  -3.4722222222222222e-3f, 2.6455026455026455e-3f,
            -9.9022633744855967e-4f,  2.0576131687242798e-4f,  -4.0187757201646091e-7f,
            -1.8098550334489978e-5f,  7.6491609160811101e-6f,  -1.6120900894563446e-6f,
            4.6471278028074343e-9f,   1.378633446915721e-7f,   -5.752545603517705e-8f,
            1.1951628599778147e-8f,   -1.7543241719747648e-11f, -1.0091543710600413e-9f,
            4.1627929918425826e-10f,  -8.5639070264929806e-11f, 6.0672151016047586e-14f,
            7.1624989648114854e-12f,  -2.9331866437714371e-12f, 5.9966963656836887e-13f,
            -2.1671786527323314e-16f, -4.9783399723692616e-14f, 2.0291628823713425e-14f,
            -4.13125571381061e-15f},
    {4.1335978835978836e-3f,   -2.6813271604938272e-3f, 7.7160493827160494e-4f,
            2.0093878600823045e-6f,   -1.0736653226365161e-4f, 5.2923448829120125e-5f,
            -1.2760635188618728e-5f,  3.4235787340961381e-8f,  1.3721957309062933e-6f,
            -6.298992138380055e-7f,   1.4280614206064242e-7f,  -2.0477098421990866e-10f,
            -1.4092529910867521e-8f,  6.228974084922022e-9f,   -1.3670488396617113e-9f,
            9.4283561590146782e-13f,  1.2872252400089318e-10f, -5.5645956134363321e-11f,
            1.1975935546366981e-11f,  -4.1689782251838635e-15f, -1.0940640427884594e-12f,
            4.6622399463901357e-13f,  -9.905105763906906e-14f, 1.8931876768373515e-17f,
            8.8592218725911273e-15f},
    {6.4943415637860082e-4f,   2.2947209362139918e-4f,  -4.6918949439525571e-4f,
            2.6772063206283885e-4f,   -7.5618016718839764e-5f, -2.3965051138672967e-7f,
            1.1082654115347302e-5f,   -5.6749528269915966e-6f, 1.4230900732435884e-6f,
            -2.7861080291528142e-11f, -1.6958404091930277e-7f, 8.0994649053880824e-8f,
            -1.9111168485973654e-8f,  2.3928620439808118e-12f, 2.0620131815488798e-9f,
            -9.4604966618551322e-10f, 2.1541049775774908e-10f, -1.388823336813903e-14f,
            -2.1894761681963939e-11f, 9.7909989511716851e-12f, -2.1782191880180962e-12f,
            6.2088195734079014e-17f,  2.126978363279737e-13f,  -9.3446887915174333e-14f,
            2.0453671226782849e-14f},
    {-8.618882909167117e-4f,   7.8403922172006663e-4f,  -2.9907248030319018e-4f,
            -1.4638452578843418e-6f,  6.6414982154651222e-5f,  -3.9683650471794347e-5f,
            1.1375726970678419e-5f,   2.5074972262375328e-10f, -1.6954149536558306e-6f,
            8.9075075322053097e-7f,   -2.2929348340008049e-7f, 2.956794137544049e-11f,
            2.8865829742708784e-8f,   -1.4189739437803219e-8f, 3.4463580499464897e-9f,
            -2.3024517174528067e-13f, -3.9409233028046405e-10f, 1.8602338968504502e-10f,
            -4.356323005056618e-11f,  1.2786001016296231e-15f, 4.6792750266579195e-12f,
            -2.1492464706134829e-12f, 4.9088156148096522e-13f, -6.3385914848915603e-18f,
            -5.0453320690800944e-14f},
    {-3.3679855336635815e-4f, -6.9728137583658578e-5f,  2.7727532449593921e-4f,
            -1.9932570516188848e-4f, 6.7977804779372078e-5f,   1.419062920643967e-7f,
            -1.3594048189768693e-5f, 8.0184702563342015e-6f,   -2.2914811765080952e-6f,
            -3.252473551298454e-10f, 3.4652846491085265e-7f,   -1.8447187191171343e-7f,
            4.8240967037894181e-8f,  -1.7989466721743515e-14f, -6.3061945000135234e-9f,
            3.1624176287745679e-9f,  -7.8409242536974293e-10f, 5.1926791652540407e-15f,
            9.3589442423067836e-11f, -4.5134262161632782e-11f, 1.0799129993116827e-11f,
            -3.661886712685252e-17f, -1.210902069055155e-12f,  5.6807435849905643e-13f,
            -1.3249659916340829e-13f},
    {5.3130793646399222e-4f,  -5.9216643735369388e-4f, 2.7087820967180448e-4f,
            7.9023532326603279e-7f,  -8.1539693675619688e-5f, 5.6116827531062497e-5f,
            -1.8329116582843376e-5f, -3.0796134506033048e-9f, 3.4651553688036091e-6f,
            -2.0291327396058604e-6f, 5.7887928631490037e-7f,  2.338630673826657e-13f,
            -8.8286007463304835e-8f, 4.7435958880408128e-8f,  -1.2545415020710382e-8f,
            8.6496488580102925e-14f, 1.6846058979264063e-9f,  -8.5754928235775947e-10f,
            2.1598224929232125e-10f, -7.6132305204761539e-16f, -2.6639822008536144e-11f,
            1.3065700536611057e-11f, -3.1799163902367977e-12f, 4.7109761213674315e-18f,
            3.6902800842763467e-13f},
    {3.4436760689237767e-4f,   5.1717909082605922e-5f,  -3.3493161081142236e-4f,
            2.812695154763237e-4f,    -1.0976582244684731e-4f, -1.2741009095484485e-7f,
            2.7744451511563644e-5f,   -1.8263488805711333e-5f, 5.7876949497350524e-6f,
            4.9387589339362704e-10f,  -1.0595367014026043e-6f, 6.1667143761104075e-7f,
            -1.7562973359060462e-7f,  -1.2974473287015439e-12f, 2.695423606288966e-8f,
            -1.4578352908731271e-8f,  3.887645959386175e-9f,  -3.8810022510194121e-17f,
            -5.3279941738772867e-10f, 2.7437977643314845e-10f, -6.9957960920705679e-11f,
            2.5899863874868481e-17f,  8.8566890996696381e-12f, -4.403168815871311e-12f,
            1.0865561947091654e-12f},
    {-6.5262391859530942e-4f,  8.3949872067208728e-4f,  -4.3829709854172101e-4f,
            -6.969091458420552e-7f,   1.6644846642067548e-4f,  -1.2783517679769219e-4f,
            4.6299532636913043e-5f,   4.5579098679227077e-9f,  -1.0595271125805195e-5f,
            6.7833429048651666e-6f,   -2.1075476666258804e-6f, -1.7213731432817145e-11f,
            3.7735877416110979e-7f,   -2.1867506700122867e-7f, 6.2202288040189269e-8f,
            6.5977038267330006e-16f,  -9.5903864974256858e-9f, 5.2132144922808078e-9f,
            -1.3991589583935709e-9f,  5.382058999060575e-16f,  1.9484714275467745e-10f,
            -1.0127287556389682e-10f, 2.6077347197254926e-11f, -5.0904186999932993e-18f,
            -3.3721464474854592e-12f},
    {-5.9676129019274625e-4f,  -7.2048954160200106e-5f, 6.7823088376673284e-4f,
            -6.4014752602627585e-4f,  2.7750107634328704e-4f,  1.8197008380465151e-7f,
            -8.4795071170685032e-5f,  6.105192082501531e-5f,   -2.1073920183404862e-5f,
            -8.8585890141255994e-10f, 4.5284535953805377e-6f,   -2.8427815022504408e-6f,
            8.7082341778646412e-7f,   3.6886101871706965e-12f, -1.5344695190702061e-7f,
            8.862466778790695e-8f,    -2.5184812301826817e-8f, -1.0225912098215092e-14f,
            3.8969470758154777e-9f,   -2.1267304792235635e-9f, 5.7370135528051385e-10f,
            -1.887749850169741e-19f,  -8.0931538694657866e-11f, 4.2382723283449199e-11f,
            -1.1002224534207726e-11f},
    {1.3324454494800656e-3f,   -1.9144384985654775e-3f, 1.1089369134596637e-3f,
            9.932404122642299e-7f,    -5.0874501293093199e-4f, 4.2735056665392884e-4f,
            -1.6858853767910799e-4f,  -8.1301893922784998e-9f, 4.5284402370562147e-5f,
            -3.127053674781734e-5f,   1.044986828530338e-5f,   4.8435226265680926e-11f,
            -2.1482565873456258e-6f,  1.329369701097492e-6f,   -4.0295693092101029e-7f,
            -1.7567877666323291e-13f, 7.0145043163668257e-8f,  -4.040787734999483e-8f,
            1.1474026743371963e-8f,   3.9642746853563325e-18f, -1.7804938269892714e-9f,
            9.7480262548731646e-10f,  -2.6405338676507616e-10f, 5.794875163403742e-18f,
            3.7647749553543836e-11f},
    {1.579727660730835e-3f,    1.6251626278391582e-4f,  -2.0633421035543276e-3f,
            2.1389686185689098e-3f,   -1.0108559391263003e-3f, -3.9912705529919201e-7f,
            3.6235025084764691e-4f,   -2.8143901463712154e-4f, 1.0449513336495887e-4f,
            2.1211418491830297e-9f,   -2.5779417251947842e-5f, 1.7281818956040463e-5f,
            -5.6413773872904282e-6f,  -1.1024320105776174e-11f, 1.1223224418895175e-6f,
            -6.8693396379526735e-7f,  2.0653236975414887e-7f,  4.6714772409838506e-14f,
            -3.5609886164949055e-8f,  2.0470855345905963e-8f,  -5.8091738633283358e-9f,
            -1.332821287582869e-16f,  9.0354604391335133e-10f, -4.9598782517330834e-10f,
            1.3481607129399749e-10f},
    {-4.0725121195140166e-3f,  6.4033628338080698e-3f,  -4.0410161081676618e-3f,
            -2.183732802866233e-6f,   2.1740441801254639e-3f,  -1.9700440518418892e-3f,
            8.3595469747962458e-4f,   1.9445447567109655e-8f,  -2.5779387120421696e-4f,
            1.9009987368139304e-4f,   -6.7696499937438965e-5f, -1.4440629666426572e-10f,
            1.5712512518742269e-5f,   -1.0304008744776893e-5f, 3.304517767401387e-6f,
            7.9829760242325709e-13f,  -6.4097794149313004e-7f, 3.8894624761300056e-7f,
            -1.1618347644948869e-7f,  -2.816808630596451e-15f, 1.9878012911297093e-8f,
            -1.1407719956357511e-8f,  3.2355857064185555e-9f,  4.1759468293455945e-20f,
            -5.0423112718105824e-10f},
    {-5.9475779383993003e-3f, -5.4016476789260452e-4f, 8.7910413550767898e-3f,
            -9.8576315587856125e-3f, 5.0134695031021538e-3f,  1.2807521786221875e-6f,
            -2.0626019342754683e-3f, 1.7109128573523058e-3f,  -6.7695312714133799e-4f,
            -6.9011545676562133e-9f, 1.8855128143995902e-4f,  -1.3395215663491969e-4f,
            4.6263183033528039e-5f,  4.0034230613321351e-11f, -1.0255652921494033e-5f,
            6.612086372797651e-6f,   -2.0913022027253008e-6f, -2.0951775649603837e-13f,
            3.9756029041993247e-7f,  -2.3956211978815887e-7f, 7.1182883382145864e-8f,
            8.925574873053455e-16f,  -1.2101547235064676e-8f, 6.9350618248334386e-9f,
            -1.9661464453856102e-9f},
    {1.7402027787522711e-2f,   -2.9527880945699121e-2f, 2.0045875571402799e-2f,
            7.0289515966903407e-6f,   -1.2375421071343148e-2f, 1.1976293444235254e-2f,
            -5.4156038466518525e-3f,  -6.3290893396418616e-8f, 1.8855118129005065e-3f,
            -1.473473274825001e-3f,   5.5515810097708387e-4f,  5.2406834412550662e-10f,
            -1.4357913535784836e-4f,  9.9181293224943297e-5f,  -3.3460834749478311e-5f,
            -3.5755837291098993e-12f, 7.1560851960630076e-6f,  -4.5516802628155526e-6f,
            1.4236576649271475e-6f,   1.8803149082089664e-14f, -2.6623403898929211e-7f,
            1.5950642189595716e-7f,   -4.7187514673841102e-8f, -6.5107872958755177e-17f,
            7.9795091026746235e-9f},
    {3.0249124160905891e-2f,   2.4817436002649977e-3f,  -4.9939134373457022e-2f,
            5.9915643009307869e-2f,   -3.2483207601623391e-2f, -5.7212968652103441e-6f,
            1.5085251778569354e-2f,   -1.3261324005088445e-2f, 5.5515262632426148e-3f,
            3.0263182257030016e-8f,   -1.7229548406756723e-3f, 1.2893570099929637e-3f,
            -4.6845138348319876e-4f,  -1.830259937893045e-10f, 1.1449739014822654e-4f,
            -7.7378565221244477e-5f,  2.5625836246985201e-5f,  1.0766165333192814e-12f,
            -5.3246809282422621e-6f,  3.349634863064464e-6f,   -1.0381253128684018e-6f,
            -5.608909920621128e-15f,  1.9150821930676591e-7f,  -1.1418365800203486e-7f,
            3.3654425209171788e-8f},
    {-9.9051020880159045e-2f,  1.7954011706123486e-1f,  -1.2989606383463778e-1f,
            -3.1478872752284357e-5f,  9.0510635276848131e-2f,  -9.2828824411184397e-2f,
            4.4412112839877808e-2f,   2.7779236316835888e-7f,  -1.7229543805449697e-2f,
            1.4182925050891573e-2f,   -5.6214161633747336e-3f, -2.39598509186381e-9f,
            1.6029634366079908e-3f,   -1.1606784674435773e-3f, 4.1001337768153873e-4f,
            1.8365800754090661e-11f,  -9.5844256563655903e-5f, 6.3643062337764708e-5f,
            -2.076250624489065e-5f,   -1.1806020912804483e-13f, 4.2131808239120649e-6f,
            -2.6262241337012467e-6f,  8.0770620494930662e-7f,  6.0125912123632725e-16f,
            -1.4729737374018841e-7f},
    {-1.9994542198219728e-1f, -1.5056113040026424e-2f, 3.6470239469348489e-1f,
            -4.6435192311733545e-1f, 2.6640934719197893e-1f,  3.4038266027147191e-5f,
            -1.3784338709329624e-1f, 1.276467178337056e-1f,   -5.6213828755200985e-2f,
            -1.753150885483011e-7f,  1.9235592956768113e-2f,  -1.5088821281095315e-2f,
            5.7401854451350123e-3f,  1.0622382710310225e-9f,  -1.5335082692563998e-3f,
            1.0819320643228214e-3f,  -3.7372510193945659e-4f, -6.6170909729031985e-12f,
            8.4263617380909628e-5f,  -5.5150706827483479e-5f, 1.7769536448348069e-5f,
            3.8827923210205533e-14f, -3.53513697488768e-6f,   2.1865832130045269e-6f,
            -6.6812849447625594e-7f},
    {7.2438608504029431e-1f,   -1.3918010932653375f,    1.0654143352413968f,
            1.876173868950258e-4f,    -8.2705501176152696e-1f, 8.9352433347828414e-1f,
            -4.4971003995291339e-1f,  -1.6107401567546652e-6f, 1.9235590165271091e-1f,
            -1.6597702160042609e-1f,  6.8882222681814333e-2f,  1.3910091724608687e-8f,
            -2.146911561508663e-2f,   1.6228980898865892e-2f,  -5.9796016172584256e-3f,
            -1.1287469112826745e-10f, 1.5167451119784857e-3f,  -1.0478634293553899e-3f,
            3.5539072889126421e-4f,   8.1704322111801517e-13f, -7.7773013442452395e-5f,
            5.0291413897007722e-5f,   -1.6035083867000518e-5f, 1.2469354315487605e-14f,
            3.1369106244517615e-6f},
    {1.6668949727276811f,      1.165462765994632e-1f,   -3.3288393225018906f,
            4.4692325482864037f,      -2.6977693045875807f,    -2.600667859891061e-4f,
            1.5389017615694539f,      -1.4937962361134612f,    6.8881964633233148e-1f,
            1.3077482004552385e-6f,   -2.5762963325596288e-1f, 2.1097676102125449e-1f,
            -8.3714408359219882e-2f,  -7.7920428881354753e-9f, 2.4267923064833599e-2f,
            -1.7813678334552311e-2f,  6.3970330388900056e-3f,  4.9430807090480523e-11f,
            -1.5554602758465635e-3f,  1.0561196919903214e-3f,  -3.5277184460472902e-4f,
            9.3002334645022459e-14f,  7.5285855026557172e-5f,  -4.8186515569156351e-5f,
            1.5227271505597605e-5f},
    {-6.6188298861372935f,     1.3397985455142589e+1f,  -1.0789350606845146e+1f,
            -1.4352254537875018e-3f,  9.2333694596189809f,     -1.0456552819547769e+1f,
            5.5105526029033471f,      1.2024439690716742e-5f,  -2.5762961164755816f,
            2.3207442745387179f,      -1.0045728797216284f,    -1.0207833290021914e-7f,
            3.3975092171169466e-1f,   -2.6720517450757468e-1f, 1.0235252851562706e-1f,
            8.4329730484871625e-10f,  -2.7998284958442595e-2f, 2.0066274144976813e-2f,
            -7.0554368915086242e-3f,  1.9402238183698188e-12f, 1.6562888105449611e-3f,
            -1.1082898580743683e-3f,  3.654545161310169e-4f,   -5.1290032026971794e-11f,
            -7.6340103696869031e-5f},
    {-1.7112706061976095e+1f,  -1.1208044642899116f,    3.7131966511885444e+1f,
            -5.2298271025348962e+1f,  3.3058589696624618e+1f,  2.4791298976200222e-3f,
            -2.061089403411526e+1f,   2.088672775145582e+1f,   -1.0045703956517752e+1f,
            -1.2238783449063012e-5f,  4.0770134274221141f,     -3.473667358470195f,
            1.4329352617312006f,      7.1359914411879712e-8f,  -4.4797257159115612e-1f,
            3.4112666080644461e-1f,   -1.2699786326594923e-1f, -2.8953677269081528e-10f,
            3.3125776278259863e-2f,   -2.3274087021036101e-2f, 8.0399993503648882e-3f,
            -1.177805216235265e-9f,   -1.8321624891071668e-3f, 1.2108282933588665e-3f,
            -3.9479941246822517e-4f},
    {7.389033153567425e+1f,    -1.5680141270402273e+2f, 1.322177542759164e+2f,
            1.3692876877324546e-2f,   -1.2366496885920151e+2f, 1.4620689391062729e+2f,
            -8.0365587724865346e+1f,  -1.1259851148881298e-4f, 4.0770132196179938e+1f,
            -3.8210340013273034e+1f,  1.719522294277362e+1f,   9.3519707955168356e-7f,
            -6.2716159907747034f,     5.1168999071852637f,     -2.0319658112299095f,
            -4.9507215582761543e-9f,  5.9626397294332597e-1f,  -4.4220765337238094e-1f,
            1.6079998700166273e-1f,   -2.4733786203223402e-8f, -4.0307574759979762e-2f,
            2.7849050747097869e-2f,   -9.4751858992054221e-3f, 6.419922235909132e-6f,
            2.1250180774699461e-3f},
    {2.1216837098382522e+2f,   1.3107863022633868e+1f,  -4.9698285932871748e+2f,
            7.3121595266969204e+2f,   -4.8213821720890847e+2f, -2.8817248692894889e-2f,
            3.2616720302947102e+2f,   -3.4389340280087117e+2f, 1.7195193870816232e+2f,
            1.4038077378096158e-4f,   -7.52594195897599e+1f,   6.651969984520934e+1f,
            -2.8447519748152462e+1f,  -7.613702615875391e-7f,  9.5402237105304373f,
            -7.5175301113311376f,     2.8943997568871961f,     -4.6612194999538201e-7f,
            -8.0615149598794088e-1f,  5.8483006570631029e-1f,  -2.0845408972964956e-1f,
            1.4765818959305817e-4f,   5.1000433863753019e-2f,  -3.3066252141883665e-2f,
            1.5109265210467774e-2f},
    {-9.8959643098322368e+2f,  2.1925555360905233e+3f,  -1.9283586782723356e+3f,
            -1.5925738122215253e-1f,  1.9569985945919857e+3f,  -2.4072514765081556e+3f,
            1.3756149959336496e+3f,   1.2920735237496668e-3f,  -7.525941715948055e+2f,
            7.3171668742208716e+2f,   -3.4137023466220065e+2f, -9.9857390260608043e-6f,
            1.3356313181291573e+2f,   -1.1276295161252794e+2f, 4.6310396098204458e+1f,
            -7.9237387133614756e-6f,  -1.4510726927018646e+1f, 1.1111771248100563e+1f,
            -4.1690817945270892f,     3.1008219800117808e-3f,  1.1220095449981468f,
            -7.6052379926149916e-1f,  3.6262236505085254e-1f,  2.216867741940747e-1f,
            4.8683443692930507e-1f}};
} // anonymous namespace

namespace IGammaCInternal {
// log1p泰勒展开版本
__simd_callee__ inline void TaylorLog1p(Reg::RegTensor<float>& dstReg, Reg::RegTensor<float>& src, Reg::MaskReg& mask)
{
    Reg::RegTensor<float> pow, term;
    Reg::Copy(dstReg, src, mask);
    Reg::Mul(pow, src, src, mask);
    Reg::Muls(term, pow, -0.5f, mask);
    Reg::Add<float, Reg::MaskMergeMode::MERGING>(dstReg, dstReg, term, mask);
    Reg::Mul(pow, pow, src, mask);
    Reg::Muls(term, pow, 0.33333334f, mask);
    Reg::Add<float, Reg::MaskMergeMode::MERGING>(dstReg, dstReg, term, mask);
    Reg::Mul(pow, pow, src, mask);
    Reg::Muls(term, pow, -0.25f, mask);
    Reg::Add<float, Reg::MaskMergeMode::MERGING>(dstReg, dstReg, term, mask);
    Reg::Mul(pow, pow, src, mask);
    Reg::Muls(term, pow, 0.2f, mask);
    Reg::Add<float, Reg::MaskMergeMode::MERGING>(dstReg, dstReg, term, mask);
    Reg::Mul(pow, pow, src, mask);
    Reg::Muls(term, pow, -0.16666667f, mask);
    Reg::Add<float, Reg::MaskMergeMode::MERGING>(dstReg, dstReg, term, mask);
}

// 计算 eta = sign(lambda-1) * sqrt(2*(sigma - log1p(sigma)))，其中 lambda=x/a, sigma=(x-a)/a
__simd_callee__ inline void Igammac_asymptotic_compute_eta(
        Reg::RegTensor<float>& etaReg,
        Reg::RegTensor<float>& lambdaReg,
        Reg::RegTensor<float>& sigmaReg,
        Reg::MaskReg& mask)
{
  Reg::RegTensor<float> tmp1, tmp2, tmp3, oneReg;
  Reg::MaskReg maskGT1, maskLT1, maskEQ1;

  Reg::Duplicate(oneReg, 1.0f, mask);

  // 分类计算log(1+sigma)
  Reg::Abs(tmp1, sigmaReg, mask);
  Reg::Compares<float, CMPMODE::LT>(maskLT1, tmp1, 0.15625f, mask); // sigma绝对值小于limit，走taylor展开
  Reg::Not(maskGT1, maskLT1, mask);
  // 使用log计算
  Reg::Add(tmp1, oneReg, sigmaReg, mask);
  Reg::Log(tmp2, tmp1, maskGT1); // log(1+sigma)
  // 使用泰勒展开计算
  TaylorLog1p(tmp2, sigmaReg, maskLT1); // log(1+sigma)

  Reg::Sub(tmp1, tmp2, sigmaReg, mask); // log(1+sigma) - sigma
  Reg::Muls(tmp1, tmp1, -2.0f, mask); // tmp1 = -2 * (log(1+sigma) - sigma)
  Reg::Sqrt(etaReg, tmp1, mask); // eta = sqrt(-2 * (log(1+sigma) - sigma))

  // 根据 lambda 与 1 的关系确定符号
  Reg::Compare<float, CMPMODE::LT>(maskLT1, lambdaReg, oneReg, mask);
  Reg::Compare<float, CMPMODE::EQ>(maskEQ1, lambdaReg, oneReg, mask);

  // lambda < 1 时，eta = -eta
  Reg::Muls(tmp2, etaReg, -1.0f, mask);
  Reg::Copy(etaReg, tmp2, maskLT1);

  // lambda == 1 时，eta = 0
  Reg::Duplicate(tmp2, 0.0f, mask);
  Reg::Copy(etaReg, tmp2, maskEQ1);
}

// 修正项计算：内层循环
template <int32_t K, int32_t N>
__simd_callee__ inline void InnerIteration(
    Reg::RegTensor<float>& etaPowN, Reg::RegTensor<float>& ckReg,
    Reg::RegTensor<float>& etaReg,Reg::MaskReg& mask)
{
    Reg::RegTensor<float> termReg;
    Reg::Copy(termReg, etaPowN, mask);
    Reg::Muls(termReg, termReg, kAsymptoticD[K][N], mask);
    Reg::Add(ckReg, ckReg, termReg, mask);
    Reg::Mul(etaPowN, etaPowN, etaReg, mask);

    if constexpr (N < 24) { // 1~24
        InnerIteration<K, N + 1>(etaPowN, ckReg, etaReg, mask);
    }
}

// 修正项计算：外层循环
template <int32_t startK, int32_t endK>
__simd_callee__ inline void OuterIteration(
    Reg::RegTensor<float>& etaReg, Reg::RegTensor<float>& aReg,
    Reg::RegTensor<float>& sumReg, Reg::RegTensor<float>& afacReg,
    Reg::MaskReg& mask)
{
    // 计算单个ck
    Reg::RegTensor<float> ckReg, etaPowN;
    Reg::Duplicate(ckReg, kAsymptoticD[startK][0], mask); // ck = D[k][0]
    Reg::Copy(etaPowN, etaReg, mask); // eta^1 = eta
    InnerIteration<startK, 1>(etaPowN, ckReg, etaReg, mask); // 固定K，循环N计算ck

    // 加权叠加ck
    Reg::Mul(ckReg, ckReg, afacReg, mask);      // term = ck * afrac
    Reg::Add(sumReg, sumReg, ckReg, mask);    // sum += term
    Reg::Div(afacReg, afacReg, aReg, mask); // afac /= a  (为下一轮准备)

    if constexpr (startK < endK) { // 0~24
        OuterIteration<startK + 1, endK>(etaReg, aReg, sumReg, afacReg, mask);
    }
}

// 计算主项
__simd_callee__ inline void Igammac_helper_asymptotic_series_float_main_terms(
        Reg::RegTensor<float>& dstReg,
        Reg::RegTensor<float>& etaReg,
        Reg::RegTensor<float>& aReg,
        Reg::RegTensor<float>& xReg,
        Reg::RegTensor<float>& sgnReg,
        Reg::MaskReg& mask)
{
  const float two_pi = 6.2831854820251465f;   // 2π

  Reg::RegTensor<float> lambdaReg, sigmaReg;
  Reg::RegTensor<float> sumReg, afacReg, termReg;
  Reg::RegTensor<float> tmp1, tmp2, tmp3;
  Reg::RegTensor<float> ckReg;

  // 1. 计算 lambda = x / a, sigma = (x - a) / a
  Reg::Div(lambdaReg, xReg, aReg, mask);
  Reg::Sub(sigmaReg, xReg, aReg, mask);
  Reg::Div(sigmaReg, sigmaReg, aReg, mask);

  // 2. 计算 eta
  Igammac_asymptotic_compute_eta(etaReg, lambdaReg, sigmaReg, mask);

  // 3. 主项: 0.5 * erfc(sgn * eta * sqrt(a/2))
  Reg::Mul(tmp1, etaReg, sgnReg, mask);         // sgn * eta
  Reg::Muls(tmp2, aReg, 0.5f, mask);                // a/2
  Reg::Sqrt(tmp2, tmp2, mask);                      // sqrt(a/2)
  Reg::Mul(tmp1, tmp1, tmp2, mask);                 // sgn * eta * sqrt(a/2)
  ERFC::ErfcClip(tmp2, tmp1, mask);
  ERFC::ErfcPublicSteps(tmp3, tmp2, mask);
  Reg::Muls(dstReg, tmp3, 0.5f, mask);              // 0.5 * erfc(...)
}


// 计算主项，存eta和主项到UB
template <typename T, bool isIgam>
__simd_vf__ inline void IgammacAsymptoticMainTerms(__ubuf__ T* dstUb, __ubuf__ T* src0Ub, __ubuf__ T* src1Ub, __ubuf__ float* workUb)
{
    Reg::MaskReg mask;
    Reg::RegTensor<T> src0Reg, src1Reg, dstReg, etaReg;

    Reg::LoadAlign(mask, workUb + 264);
    Reg::LoadAlign(src0Reg, src0Ub);
    Reg::LoadAlign(src1Reg, src1Ub);

    Reg::RegTensor<T> sgnReg;
    if constexpr (isIgam) {
        Reg::Duplicate(sgnReg, -1.0f, mask);
    } else {
        Reg::Duplicate(sgnReg, 1.0f, mask);
    }

    // mask: asymptotic
    Igammac_helper_asymptotic_series_float_main_terms(dstReg, etaReg, src0Reg, src1Reg, sgnReg, mask);
    Reg::StoreAlign(workUb + 272, etaReg, mask);
    Reg::StoreAlign(dstUb, dstReg, mask);
}

// 计算修正项，存修正项和项系数afrac到UB
template<typename T, int32_t startK, int32_t endK>
__simd_vf__ inline void IgammacAsymptoticCorrectionTerms(__ubuf__ T* src0Ub, __ubuf__ float* workUb)
{
    Reg::MaskReg mask;
    Reg::RegTensor<T> aReg, afracReg, correctionReg, etaReg;

    Reg::LoadAlign(mask, workUb + 264);
    Reg::LoadAlign(aReg, src0Ub); // aReg
    Reg::LoadAlign(etaReg, workUb + 272); // etaReg
    Reg::LoadAlign(correctionReg, workUb + 336); // correctionReg
    Reg::LoadAlign(afracReg, workUb + 400); // afracReg

    if constexpr (startK == 0) {
        Reg::Duplicate(afracReg, 1.0f, mask);
        Reg::Duplicate(correctionReg, 0.0f, mask);
    }
    // 修正项求和: sum = Σ_{k=0}^{24} ck * a^{-k}
    OuterIteration<startK, endK>(etaReg, aReg, correctionReg, afracReg, mask);
    Reg::StoreAlign(workUb + 336, correctionReg, mask);
    Reg::StoreAlign(workUb + 400, afracReg, mask);
}

// 整合主项和修正项
template<typename T, bool isIgam>
__simd_vf__ inline void IgammacAsymptoticFinalProcess(__ubuf__ T* dstUb, __ubuf__ T* src0Ub, __ubuf__ float* workUb)
{
    const float two_pi = 6.2831854820251465f;
    Reg::MaskReg mask;
    Reg::RegTensor<T> aReg, dstReg, etaReg, correctionReg, tmp1, tmp2, tmp3;

    Reg::LoadAlign(mask, workUb + 264);
    Reg::LoadAlign(aReg, src0Ub); // aReg
    Reg::LoadAlign(dstReg, dstUb); // dstReg
    Reg::LoadAlign(etaReg, workUb + 272); // etaReg
    Reg::LoadAlign(correctionReg, workUb + 336); // ub上的correction term
    Reg::RegTensor<T> sgnReg;

    if constexpr (isIgam) {
        Reg::Duplicate(sgnReg, -1.0f, mask);
    } else {
        Reg::Duplicate(sgnReg, 1.0f, mask);
    }
    // 结果: res + sgn * exp(-0.5*a*η²) * sum / sqrt(2π*a)
    Reg::Mul(tmp1, etaReg, etaReg, mask);             // η²
    Reg::Mul(tmp1, aReg, tmp1, mask);                // a * η²
    Reg::Muls(tmp1, tmp1, -0.5f, mask);              // -0.5 * a * η²
    Reg::Exp(tmp1, tmp1, mask);                      // exp(...)
    Reg::Mul(tmp2, correctionReg, tmp1, mask);              // sum * exp_term
    Reg::Muls(tmp3, aReg, two_pi, mask);            // a * 2π
    Reg::Sqrt(tmp3, tmp3, mask);                     // sqrt(2π*a)
    Reg::Div(tmp2, tmp2, tmp3, mask);                // (sum * exp_term) / sqrt(2π*a)
    Reg::Mul(tmp2, tmp2, sgnReg, mask);
    Reg::Add(dstReg, dstReg, tmp2, mask);
    Reg::StoreAlign(dstUb, dstReg, mask);
}
} // namespace IGammaCInternal
} // namespace AscendC

#endif // __ASCENDC_API_REGBASE_IGAMMAC_HELPER_AYMPTOTIC_SERIES_H__